In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame({"calisanlar": ["Ali", "Buse", "Ceren","Hande"],
                    "grup":["Muhasebe", "Mühendislik","Mühendisliik","İnsan Kaynakları"]})
df1

  calisanlar              grup
0        Ali          Muhasebe
1       Buse       Mühendislik
2      Ceren      Mühendisliik
3      Hande  İnsan Kaynakları

In [3]:
df2 = pd.DataFrame({"calisanlar": ["Ali", "Buse", "Ceren","Hande"],
                    "ilk_giris":[ 2010,2008,2012,1015 ]})
df2

  calisanlar  ilk_giris
0        Ali       2010
1       Buse       2008
2      Ceren       2012
3      Hande       1015

In [4]:
pd.merge(df1,df2)

  calisanlar              grup  ilk_giris
0        Ali          Muhasebe       2010
1       Buse       Mühendislik       2008
2      Ceren      Mühendisliik       2012
3      Hande  İnsan Kaynakları       1015

In [5]:
pd.merge(df1,df2, on="calisanlar")

  calisanlar              grup  ilk_giris
0        Ali          Muhasebe       2010
1       Buse       Mühendislik       2008
2      Ceren      Mühendisliik       2012
3      Hande  İnsan Kaynakları       1015

In [6]:
df3 = pd.merge(df1,df2)
df3

  calisanlar              grup  ilk_giris
0        Ali          Muhasebe       2010
1       Buse       Mühendislik       2008
2      Ceren      Mühendisliik       2012
3      Hande  İnsan Kaynakları       1015

In [11]:
df4 = pd.DataFrame({"grup": ["Muhasebe"  ,"Mühendisliik", "İnsan Kaynakları"], "mudur": ["Asu", "Canan", "Ece"] })
df4

               grup  mudur
0          Muhasebe    Asu
1      Mühendisliik  Canan
2  İnsan Kaynakları    Ece

In [12]:
pd.merge(df3, df4)

  calisanlar              grup  ilk_giris  mudur
0        Ali          Muhasebe       2010    Asu
1      Ceren      Mühendisliik       2012  Canan
2      Hande  İnsan Kaynakları       1015    Ece

In [14]:
df5= pd.DataFrame({"grup": ["Muhasebe"  ,"Muhasebe"  ,"Mühendisliik","Mühendisliik", "İnsan Kaynakları", "İnsan Kaynakları"], "yetenekler": ["matematik", "excel", "kodlama","linux","excel", "yonetim"] })
df5

               grup yetenekler
0          Muhasebe  matematik
1          Muhasebe      excel
2      Mühendisliik    kodlama
3      Mühendisliik      linux
4  İnsan Kaynakları      excel
5  İnsan Kaynakları    yonetim

In [15]:
df1

  calisanlar              grup
0        Ali          Muhasebe
1       Buse       Mühendislik
2      Ceren      Mühendisliik
3      Hande  İnsan Kaynakları

In [16]:
pd.merge(df1, df5)

  calisanlar              grup yetenekler
0        Ali          Muhasebe  matematik
1        Ali          Muhasebe      excel
2      Ceren      Mühendisliik    kodlama
3      Ceren      Mühendisliik      linux
4      Hande  İnsan Kaynakları      excel
5      Hande  İnsan Kaynakları    yonetim